
# ------------------------------------ Short text -------------------------------------------

CANCEL = "Завершить ❌"
DOWNLOAD_EXEL = "Загрузка файла ⤵️"
FIND_VALUES = "🔍 Нахождение элемента"

CANCEL_WRITING_DATA = "️❗️Запись данных завершена❗"
SEND_EXEL_FILE = "⤵️ Отправьте или перешлите Exel файл:"
SHOW_SELECTED_CATEGORY = "<b>☝️ Выберите категорию указанную выше ☝ или напишите то что хотите найти 🔍️</b>"
LOADED_EXEL_FILE = "📥 Файл загружен, начинайте работу 📝"

NOT_SELECTED_FILE_EXCEL = "⚠ Вы не выбрали файл, загрузите его ⚠"
IS_NOT_EXEL_FILE = "⚠ Ошибка! Это не Exel файл ⚠"

ERROR_MESSAGE_EMPTY = "⚠ Похожие элементы не найдены ⚠"
ERROR_FLOOD = "⚠ Превышен лимит отправки сообщений, попробуйте снова через 5 минут ⚠"
ERROR_ANOTHER = "⚠ Что-то пошло не так, попробуйте снова или через некоторое время ⚠"


# -------------------------------------- Long text ----------------------------------------------

START_DESCRIPTION = "<i>Этот бот облегчит вам работу с таблицами в Exel, например в таких категориях как: </i>" \
                    "<i>загрузка уже готового Exel файл в бот и начать работать уже с этим файлом; нахождение </i>" \
                    "<i>нужного элемента во всей таблице или вывод всех данных одной категории.</i>\n\n" \
                    "<b>🔻 /show_values - эта функция поможет просмотреть все значения из колонок выбрав одну </b>" \
                    "<b>категорию или конкретный элемент\n🔻 /download_exel - эта команда запрашивает ваш уже </b>" \
                    "<b>имеющийся файл, после отправки файла вы уже сможете работать с ним\n\n</b>" \
                    "<b>Ну что? Начнём работу!? 😄</b>"
